src/cfe/Catalogs/еисГАР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>еисГАР</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Catalogs/еисГАР/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		ЗагрузитьНаСервере();
	Иначе
		ЕИС_Клиент.СообщитьИнфо("Укажите Адрес");	
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Результат = ГМ_ЕИС.ВыполнитьЗапросГАР_API(Объект.Наименование);
	
	Если Результат["Ошибка"] <> Неопределено Тогда
		ГМ_ЕИС.СообщитьИнфо(Результат["Ошибка"]);
		Возврат;
	Иначе
		Если Не ЗначениеЗаполнено(Результат["guid"]) Тогда
			ГМ_ЕИС.СообщитьИнфо("В государственном адресном реестре не найдена информация об адресе["+Объект.Наименование+"]");
		КонецЕсли;
		Объект.ПолноеНаименование = Результат["НаименованиеПоКлассификатору"];
		Объект.GUID = Результат["guid"];
		Объект.Регион = Результат["Регион"];
		Объект.ОКТМО = Результат["ОКТМО"];
	КонецЕсли;
		
КонецПроцедуры
